/**
 * Інтерфейс для представлення статусу користувача.
 */
export interface UserStatus {
  /**
   * Унікальний ідентифікатор статусу.
   * @type {string}
   */
  id: string

  /**
   * Назва додатку, до якого відноситься статус (необов'язкове поле).
   * @type {string}
   */
  app?: string

  /**
   * Опис статусу (необов'язкове поле).
   * @type {string}
   */
  status?: string

  /**
   * Додаткова інформація або примітка (необов'язкове поле).
   * @type {string}
   */
  note?: string

  /**
   * Кількість відкритих елементів або завдань (необов'язкове поле).
   * @type {number}
   */
  open?: number

  /**
   * Статус закриття (необов'язкове поле).
   * @type {boolean}
   */
  closed?: boolean

  /**
   * Контактна інформація (необов'язкове поле).
   * @type {string}
   */
  contact?: string

  /**
   * Пріоритет статусу (необов'язкове поле).
   * @type {number}
   */
  priority?: number

  /**
   * Послідовність або порядок статусу (необов'язкове поле).
   * @type {number}
   */
  sequence?: number

  /**
   * Дата закінчення дії статусу у форматі UNIX (необов'язкове поле).
   * @type {number}
   */
  expires?: number

  /**
   * Тимчасова мітка статусу у форматі UNIX (необов'язкове поле).
   * @type {number}
   */
  timestamp?: number

  /**
   * Ідентифікатор домену, до якого відноситься статус (необов'язкове поле).
   * @type {number}
   */
  domain_id?: number

  /**
   * Інформація про присутність або інші дані (необов'язкове поле).
   * @type {any}
   */
  presence?: any
}
